SQLite

```
db creation
```

In [14]:
import sqlite3
conn = sqlite3.connect('Employees.db')
print("Opened database successfully");

Opened database successfully

```
CREATE  table 
```

In [15]:
# Table 1 Query:
conn.execute('''Create Table EmployeeDetails(
EmployeeID int, 
FirstName varchar(50), 
LastName varchar(50), 
Age int, 
Gender varchar(50)
);''')
conn.commit()

In [16]:
#Table 2 Query:
conn.execute('''Create Table EmployeeSalary(
EmployeeID int, 
JobTitle varchar(50), 
Salary int
);''')
conn.commit()



```
INSERT query
```

In [17]:
# Table 1 Insertion Query:
conn.execute('''Insert into EmployeeDetails VALUES
(1001, 'Jim', 'Halpert', 30, 'Male'),
(1002, 'Pam', 'Beasley', 30, 'Female'),
(1003, 'Dwight', 'Schrute', 29, 'Male'),
(1004, 'Angela', 'Martin', 31, 'Female'),
(1005, 'Toby', 'Flenderson', 32, 'Male'),
(1006, 'Michael', 'Scott', 35, 'Male'),
(1007, 'Meredith', 'Palmer', 32, 'Female'),
(1008, 'Stanley', 'Hudson', 38, 'Male'),
(1009, 'Kevin', 'Malone', 31, 'Male');''')
conn.commit()

In [18]:
# Table 2 Insertion Query:
conn.execute('''Insert Into EmployeeSalary VALUES
(1001, 'Salesman', 45000),
(1002, 'Receptionist', 36000),
(1003, 'Salesman', 63000),
(1004, 'Accountant', 47000),
(1005, 'HR', 50000),
(1006, 'Regional Manager', 65000),
(1007, 'Supplier Relations', 41000),
(1008, 'Salesman', 48000),
(1009, 'Accountant', 42000);''')
conn.commit()

```
SELECT query

In [23]:
# Select query for table1
EmployeeDetails=conn.execute('''select * from EmployeeDetails;''')
for i in EmployeeDetails:
  print(i)

(1001, 'Jim', 'Halpert', 30, 'Male')
(1002, 'Pam', 'Beasley', 30, 'Female')
(1003, 'Dwight', 'Schrute', 29, 'Male')
(1004, 'Angela', 'Martin', 31, 'Female')
(1005, 'Toby', 'Flenderson', 32, 'Male')
(1006, 'Michael', 'Scott', 35, 'Male')
(1007, 'Meredith', 'Palmer', 32, 'Female')
(1008, 'Stanley', 'Hudson', 38, 'Male')
(1009, 'Kevin', 'Malone', 31, 'Male')

In [24]:
# Select query for table2
EmployeeSalary=conn.execute('''select * from EmployeeSalary''')
for i in EmployeeSalary:
  print(i)

(1001, 'Salesman', 45000)
(1002, 'Receptionist', 36000)
(1003, 'Salesman', 63000)
(1004, 'Accountant', 47000)
(1005, 'HR', 50000)
(1006, 'Regional Manager', 65000)
(1007, 'Supplier Relations', 41000)
(1008, 'Salesman', 48000)
(1009, 'Accountant', 42000)

In [25]:
specific_columns=conn.execute('''select FirstName,LastName from EmployeeDetails''')
for i in specific_columns:
  print(i)

('Jim', 'Halpert')
('Pam', 'Beasley')
('Dwight', 'Schrute')
('Angela', 'Martin')
('Toby', 'Flenderson')
('Michael', 'Scott')
('Meredith', 'Palmer')
('Stanley', 'Hudson')
('Kevin', 'Malone')

In [36]:
top_five=conn.execute('''select * from EmployeeDetails limit 5''')
for i in top_five:
  print(i)
#SQLite does have a way to select the top N rows from an SQL query, but the syntax does not use the top keyword. Instead, the limit keyword must be used.

(1001, 'Jim', 'Halpert', 30, 'Male')
(1002, 'Pam', 'Beasley', 30, 'Female')
(1003, 'Dwight', 'Schrute', 29, 'Male')
(1004, 'Angela', 'Martin', 31, 'Female')
(1005, 'Toby', 'Flenderson', 32, 'Male')

In [38]:
distinct_values=conn.execute('''SELECT DISTINCT(Gender) FROM EmployeeDetails''')
for i in distinct_values:
  print(i)

('Male',)
('Female',)

In [41]:
gender_count=conn.execute('''select count(Gender) as Gender_Count from EmployeeDetails''')
for i in gender_count:
  print(i)

(9,)

In [44]:
# Maximum Salary
max_salary=conn.execute('''SELECT max(Salary) FROM EmployeeSalary''')
for i in max_salary:
  print(i)

(65000,)

In [45]:
# Minimum Salary
min_salary=conn.execute('''SELECT min(Salary) FROM EmployeeSalary''')
for i in min_salary:
  print(i)

(36000,)

In [46]:
# Average Salary
avg_salary=conn.execute('''SELECT avg(Salary) FROM EmployeeSalary''')
for i in avg_salary:
  print(i)

(48555.555555555555,)

In [47]:
nested_select=conn.execute('''select FirstName,LastName from EmployeeDetails where Age=(select Age from EmployeeDetails where EmployeeID=1006)''')
for i in nested_select:
  print(i)

('Michael', 'Scott')